data/2023_08_22/read_write_split_disable_5_with_read_pct_50/test-mysql-run-50-50-250-time-2023-08-22-20-24.txt
run sysbench
check mysql database exists
mysql host 172.16.134.200 connect success!
database mydb exists
/usr/bin/sysbench
cd ./sysbench/src/lua;sysbench --db-driver=mysql --mysql-host=172.16.134.200 --mysql-port=3306 --mysql-user=root --mysql-password=sf2gxx9r --mysql-db=mydb --table_size=2000000 --tables=50 --time=60 --threads=250 --events=0 --percentile=99 --read-percent=50 --write-percent=50 --skip_trx=on --mysql-ignore-errors=1062 --db-ps-mode=disable --report-interval=1 oltp_read_write_pct run
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 250
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 250 tps: 0.00 qps: 14748.20 (r/w/o: 12483.24/2264.96/0.00) lat (ms,99%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 250 tps: 0.00 qps: 6173.35 (r/w/o: 0.00/6173.35/0.00) lat (ms,99%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 250 tps: 150.00 qps: 10577.97 (r/w/o: 6625.98/3951.99/0.00) lat (ms,99%): 2985.89 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 250 tps: 100.00 qps: 11020.73 (r/w/o: 5873.86/5146.88/0.00) lat (ms,99%): 3511.19 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 250 tps: 75.00 qps: 8229.25 (r/w/o: 1770.05/6459.20/0.00) lat (ms,99%): 2539.17 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 250 tps: 158.00 qps: 12112.95 (r/w/o: 9627.96/2484.99/0.00) lat (ms,99%): 2932.60 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 250 tps: 17.00 qps: 7173.90 (r/w/o: 1101.98/6071.91/0.00) lat (ms,99%): 2932.60 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 250 tps: 48.00 qps: 5458.11 (r/w/o: 1868.04/3590.07/0.00) lat (ms,99%): 3326.55 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 250 tps: 188.00 qps: 12979.92 (r/w/o: 9696.94/3282.98/0.00) lat (ms,99%): 3574.99 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 250 tps: 14.00 qps: 6889.03 (r/w/o: 935.00/5954.03/0.00) lat (ms,99%): 3267.19 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 250 tps: 80.00 qps: 6984.00 (r/w/o: 3232.00/3752.00/0.00) lat (ms,99%): 3095.38 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 250 tps: 164.00 qps: 12110.96 (r/w/o: 8793.97/3316.99/0.00) lat (ms,99%): 3326.55 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 250 tps: 7.00 qps: 6296.03 (r/w/o: 484.00/5812.03/0.00) lat (ms,99%): 3208.88 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 250 tps: 106.00 qps: 7592.95 (r/w/o: 3942.97/3649.97/0.00) lat (ms,99%): 3326.55 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 250 tps: 139.00 qps: 11503.98 (r/w/o: 8235.99/3268.00/0.00) lat (ms,99%): 3639.94 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 250 tps: 6.00 qps: 5545.05 (r/w/o: 362.00/5183.05/0.00) lat (ms,99%): 3448.53 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 250 tps: 75.00 qps: 6035.99 (r/w/o: 2571.00/3464.99/0.00) lat (ms,99%): 3574.99 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 250 tps: 159.00 qps: 11714.76 (r/w/o: 8672.82/3041.94/0.00) lat (ms,99%): 3773.42 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 250 tps: 17.00 qps: 6723.15 (r/w/o: 1308.03/5415.12/0.00) lat (ms,99%): 3386.99 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 250 tps: 84.00 qps: 6631.97 (r/w/o: 2453.99/4177.98/0.00) lat (ms,99%): 3208.88 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 250 tps: 144.00 qps: 11529.96 (r/w/o: 8713.97/2815.99/0.00) lat (ms,99%): 3326.55 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 250 tps: 23.00 qps: 6898.05 (r/w/o: 1411.01/5487.04/0.00) lat (ms,99%): 3574.99 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 250 tps: 70.00 qps: 6233.98 (r/w/o: 2015.99/4217.99/0.00) lat (ms,99%): 3208.88 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 250 tps: 147.99 qps: 11492.30 (r/w/o: 8759.47/2732.83/0.00) lat (ms,99%): 3773.42 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 250 tps: 28.00 qps: 6124.37 (r/w/o: 1542.09/4582.28/0.00) lat (ms,99%): 3511.19 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 250 tps: 50.00 qps: 6443.03 (r/w/o: 1862.01/4581.02/0.00) lat (ms,99%): 3386.99 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 250 tps: 178.00 qps: 12775.83 (r/w/o: 9106.88/3668.95/0.00) lat (ms,99%): 3574.99 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 250 tps: 25.00 qps: 6380.06 (r/w/o: 1643.02/4737.05/0.00) lat (ms,99%): 3326.55 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 250 tps: 64.00 qps: 6735.82 (r/w/o: 2238.94/4496.88/0.00) lat (ms,99%): 3267.19 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 250 tps: 152.00 qps: 10914.30 (r/w/o: 8079.22/2835.08/0.00) lat (ms,99%): 3448.53 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 250 tps: 35.00 qps: 7397.02 (r/w/o: 2229.01/5168.01/0.00) lat (ms,99%): 3386.99 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 250 tps: 68.00 qps: 6626.95 (r/w/o: 2251.98/4374.96/0.00) lat (ms,99%): 3151.62 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 250 tps: 149.00 qps: 11841.04 (r/w/o: 8522.03/3319.01/0.00) lat (ms,99%): 3448.53 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 250 tps: 31.00 qps: 5690.00 (r/w/o: 1598.00/4092.00/0.00) lat (ms,99%): 3267.19 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 250 tps: 39.00 qps: 6115.66 (r/w/o: 1565.91/4549.74/0.00) lat (ms,99%): 3574.99 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 250 tps: 178.01 qps: 12344.61 (r/w/o: 9097.45/3247.16/0.00) lat (ms,99%): 3511.19 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 250 tps: 36.00 qps: 7257.06 (r/w/o: 1985.02/5272.04/0.00) lat (ms,99%): 3511.19 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 250 tps: 68.00 qps: 7075.78 (r/w/o: 2235.93/4839.85/0.00) lat (ms,99%): 3151.62 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 250 tps: 152.00 qps: 11228.27 (r/w/o: 8348.20/2880.07/0.00) lat (ms,99%): 3448.53 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 250 tps: 32.00 qps: 7682.05 (r/w/o: 2048.01/5634.03/0.00) lat (ms,99%): 3386.99 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 250 tps: 99.00 qps: 7210.98 (r/w/o: 2992.99/4217.99/0.00) lat (ms,99%): 3095.38 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 250 tps: 133.00 qps: 12239.99 (r/w/o: 8537.99/3702.00/0.00) lat (ms,99%): 3151.62 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 250 tps: 20.00 qps: 5437.04 (r/w/o: 993.01/4444.03/0.00) lat (ms,99%): 3267.19 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 250 tps: 87.00 qps: 7762.98 (r/w/o: 3248.99/4513.99/0.00) lat (ms,99%): 3151.62 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 250 tps: 142.00 qps: 11767.74 (r/w/o: 8199.82/3567.92/0.00) lat (ms,99%): 3639.94 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 250 tps: 26.00 qps: 6528.17 (r/w/o: 1341.03/5187.13/0.00) lat (ms,99%): 3267.19 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 250 tps: 109.00 qps: 7571.95 (r/w/o: 3421.98/4149.97/0.00) lat (ms,99%): 3151.62 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 250 tps: 118.00 qps: 11521.00 (r/w/o: 7984.00/3537.00/0.00) lat (ms,99%): 3386.99 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 250 tps: 38.00 qps: 7708.44 (r/w/o: 1734.87/5973.57/0.00) lat (ms,99%): 2985.89 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 250 tps: 134.00 qps: 7636.10 (r/w/o: 4145.05/3491.05/0.00) lat (ms,99%): 3208.88 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 250 tps: 85.00 qps: 10906.35 (r/w/o: 6816.22/4090.13/0.00) lat (ms,99%): 3386.99 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 250 tps: 38.00 qps: 6568.10 (r/w/o: 1635.03/4933.08/0.00) lat (ms,99%): 3267.19 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 250 tps: 101.00 qps: 7065.10 (r/w/o: 3561.05/3504.05/0.00) lat (ms,99%): 3208.88 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 250 tps: 109.00 qps: 10956.97 (r/w/o: 7301.98/3654.99/0.00) lat (ms,99%): 3511.19 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 250 tps: 36.00 qps: 6605.69 (r/w/o: 1564.93/5040.77/0.00) lat (ms,99%): 3208.88 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 250 tps: 154.01 qps: 10827.54 (r/w/o: 6465.32/4362.22/0.00) lat (ms,99%): 3208.88 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 250 tps: 70.00 qps: 8843.00 (r/w/o: 4781.00/4062.00/0.00) lat (ms,99%): 3267.19 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 250 tps: 28.00 qps: 5830.02 (r/w/o: 1514.01/4316.02/0.00) lat (ms,99%): 3095.38 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 250 tps: 144.00 qps: 8644.90 (r/w/o: 4470.95/4173.95/0.00) lat (ms,99%): 3386.99 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 250 tps: 80.00 qps: 10736.05 (r/w/o: 6711.03/4025.02/0.00) lat (ms,99%): 3574.99 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 250 tps: 39.00 qps: 4862.76 (r/w/o: 167.99/4694.77/0.00) lat (ms,99%): 3208.88 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            262900
        write:                           262900
        other:                           0
        total:                           525800
    transactions:                        5258   (85.23 per sec.)
    queries:                             525800 (8523.17 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          61.6897s
    total number of events:              5258

Latency (ms):
         min:                                 1703.30
         avg:                                 2914.38
         max:                                 3864.32
         99th percentile:                     3511.19
         sum:                             15323806.94

Threads fairness:
    events (avg/stddev):           21.0320/0.20
    execution time (avg/stddev):   61.2952/0.33